SAVEPOINT : Final README
